; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v3 ?v9)
             (pred_1 ?v6 ?v13)
             (pred_10 ?v3 ?v13)
             (pred_11 ?v7 ?v3 )
	     (pred_5 ?v3)
             (pred_4 ?v1)
             (pred_3 ?v6)
             (pred_8 ?v13)
             (pred_2 ?v3)
             (pred_7 ?v6)
             (pred_9 ?v3)
             (pred_12 ))



(:action op_2
:parameters (?v10 ?v2 ?v12 ?v8)
:precondition (and (pred_4 ?v10) (pred_4 ?v2) (pred_3 ?v12) (pred_8 ?v8)
          (pred_6 ?v10 ?v2) (pred_1 ?v12 ?v8)
                   (pred_10 ?v2 ?v8) (pred_5 ?v10) 
                   (pred_2 ?v2) (pred_7 ?v12))
:effect (and  (pred_9 ?v2) (not (pred_2 ?v2))))


(:action op_1
:parameters (?v10 ?v11)
:precondition (and (pred_4 ?v10) (pred_4 ?v11)
               (pred_5 ?v10) (pred_6 ?v10 ?v11) (pred_9 ?v11))
:effect (and (pred_5 ?v11) (not (pred_5 ?v10))))

(:action op_3
:parameters (?v10 ?v12)
:precondition (and (pred_4 ?v10) (pred_3 ?v12) 
                  (pred_5 ?v10) (pred_11 ?v12 ?v10) (pred_12 ))
:effect (and (pred_7 ?v12)
   (not (pred_11 ?v12 ?v10)) (not (pred_12 ))))


(:action op_4
:parameters (?v10 ?v5 ?v4)
:precondition (and (pred_4 ?v10) (pred_3 ?v5) (pred_3 ?v4)
                  (pred_5 ?v10) (pred_7 ?v4) (pred_11 ?v5 ?v10))
:effect (and (pred_7 ?v5) (pred_11 ?v4 ?v10)
        (not (pred_7 ?v4)) (not (pred_11 ?v5 ?v10))))

(:action op_5
:parameters (?v10 ?v12)
:precondition (and (pred_4 ?v10) (pred_3 ?v12) 
                  (pred_5 ?v10) (pred_7 ?v12))
:effect (and (pred_12 ) (pred_11 ?v12 ?v10) (not (pred_7 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_12 obj_18 obj_19 obj_14 obj_07 obj_20 obj_06 obj_15 obj_17 obj_11 obj_04 obj_09 obj_16 obj_10 obj_05
    obj_13 obj_02
    obj_21 obj_03 obj_08
    )

    (:init
       (pred_12)

       (pred_4 obj_01)
       (pred_4 obj_12)
       (pred_4 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_04)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_10)
       (pred_4 obj_05)
       (pred_8 obj_13)
       (pred_8 obj_02)
       (pred_3 obj_21)
       (pred_3 obj_03)
       (pred_3 obj_08)

       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_18 obj_19)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_19 obj_18)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_19)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_11 obj_04)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_11)
       (pred_6 obj_09 obj_16)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_09)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_10)
       (pred_2 obj_14)
       (pred_2 obj_04)
       (pred_2 obj_16)
       (pred_10  obj_14 obj_13)
       (pred_10  obj_04 obj_02)
       (pred_10  obj_16 obj_13)
       (pred_9 obj_01)
       (pred_9 obj_12)
       (pred_9 obj_18)
       (pred_9 obj_19)
       (pred_9 obj_07)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_17)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_10)
       (pred_9 obj_05)

       (pred_1  obj_21 obj_13)
       (pred_1  obj_03 obj_02)
       (pred_1  obj_08 obj_02)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_08 obj_20)
       (pred_5 obj_12)
    )

    (:goal (and
       (pred_11 obj_21 obj_17)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_08 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_11)))
)
)

; plan
1. (op_1 obj_12 obj_07)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_07)
   goals met: 0 of 3
2. (op_1 obj_07 obj_17)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_17)
   goals met: 0 of 3
3. (op_1 obj_17 obj_15)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_15)
   goals met: 0 of 3
4. (op_1 obj_15 obj_09)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_09)
   goals met: 0 of 3
5. (op_3 obj_09 obj_21)
   deleted: (pred_11 obj_21 obj_09) (pred_12)
   added: (pred_7 obj_21)
   goals met: 0 of 3
6. (op_1 obj_09 obj_15)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_15)
   goals met: 0 of 3
7. (op_1 obj_15 obj_17)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_17)
   goals met: 0 of 3
8. (op_5 obj_17 obj_21)
   deleted: (pred_7 obj_21)
   added: (pred_12) (pred_11 obj_21 obj_17)
   goals met: 1 of 3
9. (op_1 obj_17 obj_07)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_07)
   goals met: 1 of 3
10. (op_1 obj_07 obj_20)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_20)
   goals met: 1 of 3
11. (op_3 obj_20 obj_08)
   deleted: (pred_11 obj_08 obj_20) (pred_12)
   added: (pred_7 obj_08)
   goals met: 1 of 3
12. (op_1 obj_20 obj_07)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_07)
   goals met: 1 of 3
13. (op_1 obj_07 obj_17)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_17)
   goals met: 1 of 3
14. (op_1 obj_17 obj_15)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_15)
   goals met: 1 of 3
15. (op_5 obj_15 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_12) (pred_11 obj_08 obj_15)
   goals met: 1 of 3
16. (op_1 obj_15 obj_09)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_09)
   goals met: 1 of 3
17. (op_3 obj_09 obj_03)
   deleted: (pred_11 obj_03 obj_09) (pred_12)
   added: (pred_7 obj_03)
   goals met: 1 of 3
18. (op_1 obj_09 obj_15)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_15)
   goals met: 1 of 3
19. (op_1 obj_15 obj_17)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_17)
   goals met: 1 of 3
20. (op_5 obj_17 obj_03)
   deleted: (pred_7 obj_03)
   added: (pred_12) (pred_11 obj_03 obj_17)
   goals met: 1 of 3
21. (op_1 obj_17 obj_15)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_15)
   goals met: 1 of 3
22. (op_3 obj_15 obj_08)
   deleted: (pred_11 obj_08 obj_15) (pred_12)
   added: (pred_7 obj_08)
   goals met: 1 of 3
23. (op_1 obj_15 obj_17)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_17)
   goals met: 1 of 3
24. (op_1 obj_17 obj_07)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_07)
   goals met: 1 of 3
25. (op_5 obj_07 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_12) (pred_11 obj_08 obj_07)
   goals met: 2 of 3
26. (op_1 obj_07 obj_17)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_17)
   goals met: 2 of 3
27. (op_3 obj_17 obj_03)
   deleted: (pred_11 obj_03 obj_17) (pred_12)
   added: (pred_7 obj_03)
   goals met: 2 of 3
28. (op_1 obj_17 obj_07)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_07)
   goals met: 2 of 3
29. (op_1 obj_07 obj_20)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_20)
   goals met: 2 of 3
30. (op_1 obj_20 obj_06)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_06)
   goals met: 2 of 3
31. (op_2 obj_06 obj_04 obj_03 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_9 obj_04)
   goals met: 2 of 3
32. (op_1 obj_06 obj_04)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_04)
   goals met: 2 of 3
33. (op_5 obj_04 obj_03)
   deleted: (pred_7 obj_03)
   added: (pred_12) (pred_11 obj_03 obj_04)
   goals met: 3 of 3
